# SA-YOLO: Stage-Aware Attention configuration (this work)
# Reference implementation for IEEE Access submission
nc: 2
scales:
  n: [0.50, 0.25, 1024]
  # s: [0.50, 0.50, 1024] # summary: 272 layers, 9,284,096 parameters, 9,284,080 gradients, 21.7 GFLOPs

backbone:
  - [-1, 1, Conv, [64, 3, 2]]               # 0
  - [-1, 1, Conv, [128, 3, 2]]              # 1
  - [-1, 2, C3k2, [256, False, 0.25]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]              # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]       # 4
  - [-1, 1, ECA, []]                        # 5 (Stage 1)
  - [-1, 1, Conv, [512, 3, 2]]              # 6 - P4/16
  - [-1, 4, A2C2f, [512, True, 4]]          # 7
  - [-1, 1, PAM, []]          # 8 (Stage 2)
  - [-1, 1, Conv, [1024, 3, 2]]             # 9 - P5/32
  - [-1, 4, A2C2f, [1024, True, 1]]         # 10
  - [-1, 1, ResECA, []]          # 11 (Stage 3)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12
  - [[-1, 8], 1, Concat, [1]]                     # cat P4
  - [-1, 2, A2C2f, [512, False, -1]]              # 14
  - [-1, 1, PAM, []]                # 15 (Stage 2)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16
  - [[-1, 5], 1, Concat, [1]]                     # cat P3
  - [-1, 2, A2C2f, [256, False, -1]]              # 18
  - [-1, 1, ECA, []]                              # 19 (Stage 1)

  - [-1, 1, Conv, [256, 3, 2]]                    # 20
  - [[-1, 15], 1, Concat, [1]]                    # cat P4
  - [-1, 2, A2C2f, [512, False, -1]]              # 22
  - [-1, 1, PAM, []]                # 23 (Stage 2)

  - [-1, 1, Conv, [512, 3, 2]]                    # 24
  - [[-1, 11], 1, Concat, [1]]                    # cat P5
  - [-1, 2, C3k2, [1024, True]]                   # 26
  - [-1, 1, ResECA, []]                # 27 (Stage 3)

  - [[19, 23, 27], 1, Detect, [nc]]               # Detect(P3, P4, P5)
